In [1]:
import numpy as np
import pandas as pd

In [2]:
n=10

In [3]:
data = {'Name':["sai","ram","nithu","sheema","sruthi","rahul","abi","sabs","hrithik","hari"],
        'Age':[19,22,34,10,5,12,46,54,9,21],
        'gender':["M","M","F","F","F","M","M","M","M","M"],
        'sport':["Football","Neither","Cricket","Cricket","Neither","Cricket","Neither","Cricket","Football","Football"]}

In [4]:
df=pd.DataFrame(data)

In [5]:
df

      Name  Age gender     sport
0      sai   19      M  Football
1      ram   22      M   Neither
2    nithu   34      F   Cricket
3   sheema   10      F   Cricket
4   sruthi    5      F   Neither
5    rahul   12      M   Cricket
6      abi   46      M   Neither
7     sabs   54      M   Cricket
8  hrithik    9      M  Football
9     hari   21      M  Football

In [6]:
df['gender'].replace({"M": 0, "F": 1},inplace=True)

In [7]:
df

      Name  Age  gender     sport
0      sai   19       0  Football
1      ram   22       0   Neither
2    nithu   34       1   Cricket
3   sheema   10       1   Cricket
4   sruthi    5       1   Neither
5    rahul   12       0   Cricket
6      abi   46       0   Neither
7     sabs   54       0   Cricket
8  hrithik    9       0  Football
9     hari   21       0  Football

In [8]:
data1={'name':["Motu"],'Age':[15],'gender':["M"],'sport':['']}
data1

{'name': ['Motu'], 'Age': [15], 'gender': ['M'], 'sport': ['']}

In [9]:
df1=pd.DataFrame(data1)

In [10]:
df1

   name  Age gender sport
0  Motu   15      M

In [11]:
 df1['gender'].replace({'M':0,'F':1},inplace=True)

In [12]:
df1

   name  Age  gender sport
0  Motu   15       0

In [13]:
range(len(df1))

range(0, 1)

In [14]:
a=[]
b=[]
c=[]
d=[]
for i in range(len(df)):
    for j in range(len(df1)):
        a=(df['Age'][i]-df1['Age'][0])**2
        #print("a=",a)
        b=(df['gender'][i]-df1['gender'][0])**2
        #print("b=",b)
        c=a+b
    d.append(c)

In [15]:
d

[16, 49, 362, 26, 101, 9, 961, 1521, 36, 36]

In [16]:
output = np.sqrt(d)

In [17]:
output

array([ 4.        ,  7.        , 19.02629759,  5.09901951, 10.04987562,
        3.        , 31.        , 39.        ,  6.        ,  6.        ])

In [18]:
 from scipy.stats import rankdata

In [19]:
ranks=rankdata(output, method='min')
ranks

array([ 2,  6,  8,  3,  7,  1,  9, 10,  4,  4], dtype=int64)

In [5]:
e

[]

In [6]:
e1 = []
for i in e:
    if i not in e1:
        e1.append(i)

In [23]:
e1

[4.0, 5.0990195135927845, 3.0]

In [24]:
f=[]
for i in range(len(e1)):
    for j in range(len(df)):
        if(e[i]==output[j]):
            f.append(df['sport'][j])

In [25]:
f

['Football', 'Cricket', 'Cricket']

In [26]:
f.count('Cricket')

2

In [27]:
f.count('Football')

1

In [28]:
y=[]
def most_frequent(f):
    counter = 0
    num = f[0]
     
    for i in f:
        curr_frequency = f.count(i)
        if(curr_frequency> counter):
            counter = curr_frequency
            num = i
 
    return num
y.append(most_frequent(f))

print(most_frequent(f))

Cricket

In [29]:
df1['sport'].replace({'':y[0]},inplace=True)

In [30]:
df1

   name  Age  gender    sport
0  Motu   15       0  Cricket

# MOTU PLAYS CRICKET